## noteql Example Notebook

### Install

In [1]:
!pip install noteql > pip.log

### Import library and create session.

This will create an in momory sqlite database for the purpose of these examples

In [2]:
import noteql
session = noteql.Session(dburi='sqlite://')

# For actual persisted sqlite database
#session = noteql.Session(dburi='sqlite:///my.db')

# For postgres
# session = noteql.Session('postgresql://user:pass@host/dbname')

Using db connection sqlite://

### Create example table

The `CREATE` command makes a table based on the query.  Adding `SHOW` means we can also see the contents of the table as well.

In [3]:
%%nql CREATE test SHOW

SELECT 'a' atitle, 'b' btitle
UNION ALL
select 'aa', 'bb'
UNION ALL
select 'aaa', 'bbb'

  atitle btitle
0      a      b
1     aa     bb
2    aaa    bbb

### Querying and retrieving data

Lets look do a query on the table. The results are given back as a pandas dataframe.

In [4]:
%%nql
SELECT * FROM test where length(atitle) > 1

  atitle btitle
0     aa     bb
1    aaa    bbb

The above does not save dataframe to a python variable. Lets do that using an assignment in the %%nql magic line.

In [5]:
%%nql test_df=DF

SELECT * FROM test where length(atitle) > 1

In [6]:
test_df

  atitle btitle
0     aa     bb
1    aaa    bbb

`DF` is a special command to say we want a dataframe to be put in variable `test_df`.
Sometimes we might want python variables instead. There are various command to do that.

In [7]:
%%nql test_records=RECORDS

SELECT * FROM test where length(atitle) > 1

In [8]:
test_records

[{'atitle': 'aa', 'btitle': 'bb'}, {'atitle': 'aaa', 'btitle': 'bbb'}]

You can assign to more that one variable at a time. These are all the current availible assignments and their outputs.

In [9]:
%%nql col=COL cols=COLS row=ROW rows=ROWS cell=CELL record=RECORD records=RECORDS headings=HEADINGS sql=SQL
SELECT * FROM test where length(atitle) > 1

In [10]:
print('headings:', headings) # list of field name


print('row:', row) # first row as list
print('rows:', rows) # all rows as list of lists
print('col:', col) # first column as list
print('cols:', cols) # all columns as list of list
print('cell:', cell) # first item in first cell.
print('record:', record) # first row as dict
print('records:', records) # all rows as lists of dicts

print('sql:', sql) # the sql in the cell

headings: ['atitle', 'btitle']
row: ['aa', 'bb']
rows: [['aa', 'bb'], ['aaa', 'bbb']]
col: ['aa', 'aaa']
cols: [['aa', 'aaa'], ['bb', 'bbb']]
cell: aa
record: {'atitle': 'aa', 'btitle': 'bb'}
records: [{'atitle': 'aa', 'btitle': 'bb'}, {'atitle': 'aaa', 'btitle': 'bbb'}]
sql: SELECT * FROM test where length(atitle) > 1

### Parameters an jinja templating

You can use jinja templating to send paremeters to your sql.

In [11]:
my_variable = 'aa'

In [12]:
%%nql 

SELECT * FROM test where atitle = {{my_variable}}

  atitle btitle
0     aa     bb

Quotes should NOT be put around variables as they are sent as database parameters. There is a filter for in statements

In [13]:
variables = ['aa', 'aaa']

In [14]:
%%nql 

SELECT * FROM test where atitle in {{variables | inclause}}

  atitle btitle
0     aa     bb
1    aaa    bbb